app/views/home/friends.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
            <td>
                <% User.where("id =?", friend.name).each do |email| %>