app/views/home/recommendations.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
                        <% if index == @recommendedBy.size - 1 %>
                            <%= User.where("id =?", hasSeen.id).first.email %>