app/controllers/games_controller.rb

  def create
    @game = current_user.game.build(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("user_id", "name", "company", "year", "genre", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "name" = ?, "company" = ?, "year" = ?, "genre" = ?, "rating" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["name", "Mario 2.0"], ["company", "someone better"], ["year", 2020], ["genre", "genre1, genre2, genre3"], ["rating", 100.5], ["updated_at", "2022-11-01 16:59:39.837114"], ["id", 1]]

  def isVerified
    @game = current_user.game.find_by(id: params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = ? AND "games"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]