app/controllers/home_controller.rb

  def friends
    if !user_signed_in?
      flash[:notice] = "You need to log in first!"
      redirect_to new_user_session_path
    end

    @friendsEmpty = false

    if user_signed_in?
      @userFriends = Friend.where("user_id =?", current_user.id)
      @users = User.where("id !=?", 0)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

          #who has seen this and is friends with the user
          @movieRecommendedBy = Array.new
          Movie.where("name =?", @movieRecommendation.name).each do |hasSeen|
            @poss = User.where("id =?", hasSeen.user_id).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]