app/controllers/home_controller.rb

  def index
    @moviesEmpty = false
    @gamesEmpty = false
    @podcastsEmpty = false
    @showsEmpty = false

    if user_signed_in?
      @userMovies = Movie.where("user_id =?", current_user.id)
      @userGames = Game.where("user_id =?", current_user.id)
      @userPodcasts = Podcast.where("user_id =?", current_user.id)
      @userShows = TvShow.where("user_id =?", current_user.id)
---
SELECT "movies".* FROM "movies" WHERE (user_id =2)
SELECT "games".* FROM "games" WHERE (user_id =2)
SELECT "podcasts".* FROM "podcasts" WHERE (user_id =2)
SELECT "tv_shows".* FROM "tv_shows" WHERE (user_id =2)