app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "director", "movie_stars", "year", "genre", "rating", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movie.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "name" = ?, "director" = ?, "movie_stars" = ?, "year" = ?, "genre" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."user_id" = ? AND "movies"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]
---
  def isVerified
    @movie = current_user.movie.find_by(id: params[:id])