app/controllers/podcasts_controller.rb

  def create
    @podcast = current_user.podcast.build(podcast_params)

    respond_to do |format|
      if @podcast.save
---
INSERT INTO "podcasts" ("user_id", "name", "company", "recent_episode", "genre", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @podcast.update(podcast_params)
---
UPDATE "podcasts" SET "name" = ?, "company" = ?, "recent_episode" = ?, "genre" = ?, "rating" = ?, "updated_at" = ? WHERE "podcasts"."id" = ?

  def destroy
    @podcast.destroy
---
DELETE FROM "podcasts" WHERE "podcasts"."id" = ?  [["id", 1]]

  def isVerified
    @poscast = current_user.podcast.find_by(id: params[:id])
---
SELECT "podcasts".* FROM "podcasts" WHERE "podcasts"."user_id" = ? AND "podcasts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    def set_podcast
      @podcast = Podcast.find(params[:id])
---
SELECT "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]