app/controllers/tv_shows_controller.rb

  def index
    @tv_shows = TvShow.all
---
SELECT "tv_shows".* FROM "tv_shows"

  def create
    @tv_show = current_user.tv_show.build(tv_show_params)

    respond_to do |format|
      if @tv_show.save
---
INSERT INTO "tv_shows" ("user_id", "name", "director", "show_stars", "seasons", "genre", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @tv_show.update(tv_show_params)
---
UPDATE "tv_shows" SET "name" = ?, "director" = ?, "show_stars" = ?, "seasons" = ?, "genre" = ?, "rating" = ?, "updated_at" = ? WHERE "tv_shows"."id" = ?

  def destroy
    @tv_show.destroy
---
DELETE FROM "tv_shows" WHERE "tv_shows"."id" = ?  [["id", 2]]

  def isVerified
    @tv_show = current_user.tv_show.find_by(id: params[:id])
---
SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."user_id" = ? AND "tv_shows"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]

    def set_tv_show
      @tv_show = TvShow.find(params[:id])
---
SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]